[
   {
      "id":"1",
      "term":"Application-données générales",
      "definition":"<div>Toutes les données relatives à une application en général et qui ne sont pas liées à un objet d'intérêt d'un processus fonctionnel spécifique.</div>"
   },
   {
      "id":"2",
      "term":"Application",
      "definition":"<div>Un système de logiciel pour la collecte, l'enregistrement, traitement et présentation de données au moyen d'un ordinateur.</div><br> <div>Remarque : C'est une adaptation de la définition fournie par 'ISO/IEC 24570:2005 Software engineering—NESMA functional size measurement method version 2.1'.</div><br> <div>(Définition alternative pour 'application logicielle'). Logiciel conçu pour aider les utilisateurs à effectuer des tâches particulières ou pour traiter certains types de problèmes, par opposition à un logiciel qui contrôle l'ordinateur lui-même.</div><br> <div>Remarque: Il s'agit d'une légère adaptation de la définition fournie par  'ISO/IEC 24765:2010 Systems and software engineering-vocabulary, 4.5').</div>"
   },
   {
      "id":"3",
      "term":"Attribut de données (synonyme d'élément de données type)",
      "definition":"<div>La plus petite parcelle d'information codée, dans un <u>groupe de données</u>, possédant une signification dans la perspective des <u>Fonctionnalités Utilisateurs Requises</u> (FUR) du logiciel.</div>"
   },
   {
      "id":"4",
      "term":"C",
      "definition":"<div>Abréviation pour '<u>éCriture</u> type'.</div>"
   },
   {
      "id":"5",
      "term":"Commande de contrôle",
      "definition":"<div>Une commande qui permet à un <u>utilisateur fonctionnel</u> de contrôler l'utilisation du logiciel mais qui n'implique pas de mouvement de données à propos d'un <u>objet d'intérêt de la FUR du logiciel à mesurer</u>.</div><br> <div>Remarque: Une <u>commande de contrôle</u> n'est pas un <u>mouvement de données</u> parce que la commande ne déplace pas des données d'un <u>objet d'intérêt</u>. Exemples: commande de 'page haut/bas', presser sur Tab ou la clef Enter (Entrée), cliquer sur 'OK' pour confirmer une action précédente, presser un bouton pour continuer, etc.</div>"
   },
   {
      "id":"6",
      "term":"Composant fonctionnel de base (CFB)",
      "definition":"<div>Unité élémentaire des <u>Fonctionnalités Utilisateurs Requises</u> (FUR), définie par la méthode de mesure de la taille fonctionnelle (MTF) pour les fins du mesurage.</div><br> <div>Remarque: La méthode COSMIC définit un type de mouvement de données comme un CFB.</div>"
   },
   {
      "id":"7",
      "term":"Composant fonctionnel de base (ou type de CFB)",
      "definition":"<div>Une catégorie définie de CFB. La méthode COSMIC a 4 types de CFB, <u>Entrée, Sortie, Lecture et éCriture (types)</u>.</div>"
   },
   {
      "id":"8",
      "term":"Composant",
      "definition":"<div>Toute partie d'un <u>système logiciel</u> qui est séparé pour des raisons d'architecture du logiciel, et/ou qui a été spécifié, conçu ou mis au point séparément.</div>"
   },
   {
      "id":"9",
      "term":"Couche",
      "definition":"<div>Une partition fonctionnelle d'une architecture d'un système logiciel.</div>"
   },
   {
      "id":"10",
      "term":"E",
      "definition":"<div>Abréviation pour <u>'Entrée' </u>(type).</div>"
   },
   {
      "id":"11",
      "term":"ECriture (type)",
      "definition":"<div>Un mouvement de données qui déplace un groupe de données depuis un processus fonctionnel vers un stockage persistant.</div><br><div>Remarque : Une éCriture est considérée comme prenant en compte certaines manipulations de données associées (voir le Manuel de mesurage sous-section 3.3.5 pour plus de détails).</div>"
   },
   {
      "id":"12",
      "term":"Entrée (type)",
      "definition":"<div>Un type de <u>mouvement de données</u> qui déplace, à travers la frontière, <u>un groupe de données </u>depuis un <u>utilisateur fonctionnel</u> vers le <u>processus fonctionnel</u> où il est requis.</div><br> <div>Remarque: Un type d'Entrée tient aussi compte de certaines <u>manipulations de données</u> associées - voir le Manuel de Mesurage pour plus de détails).</div>"
   },
   {
      "id":"13",
      "term":"Entrée de déclenchement (type)",
      "definition":"<div>Un mouvement de donnée 'Entrée' d'un processus fonctionnel qui déplace un groupe de données, généré par un <u>utilisateur fonctionnel</u>, nécessaire au <u>processus fonctionnel</u> pour son démarrage.</div><br> <div>Remarque: La <u>FUR</u> d'un <u>processus fonctionnel</u> peut exiger une ou plusieurs autres <u>Entrées</u> en plus de l'Entrée de déclenchement.</div>"
   },
   {
      "id":"14",
      "term":"Environnement opérationnel (logiciel)",
      "definition":"<div>L'ensemble des logiciels fonctionnant simultanément sur un ordinateur spécifié sur lequel l'application logicielle dépend.</div>"
   },
   {
      "id":"15",
      "term":"Evènement déclencheur (type)",
      "definition":"<div>Un évènement, reconnu dans les Fonctionnalités Utilisateur Requises du logiciel à mesurer, qui cause un ou plusieurs utilisateurs fonctionnels du logiciel à mesurer, la génération d'un ou plusieurs groupes de données, chacun d'eux sera par la suite déplacé par une Entrée de déclenchement. Un évènement déclencheur ne peut pas être subdivisé et ou bien il s'est produit ou bien il ne s'est pas produit.</div><br> <div>Remarque: L'horloge et les évènements de calendrier peuvent être de évènements déclencheurs.</div>"
   },
   {
      "id":"16",
      "term":"Exigences non fonctionnelles",
      "definition":"<div>Toute exigence sur la partie logicielle d'un système (équipement/logiciel) ou sur un produit logiciel, incluant comment il devrait être développé et maintenu, et comment il devrait se comporter lors de son fonctionnement, sauf la Fonctionnalité Utilisateur Requise d'un logiciel.</div><br> <div>Les exigences Non-Fonctionnelles concernent :</div><div> <ul><li>la qualité du logiciel;</li> <li>l'environnement dans lequel le logiciel doit être réalisé et qu'il doit servir;</li> <li>les processus et technologies qui doivent être utilisés pour développer et maintenir le logiciel</li> <li>la technologie qui doit être utilisée pour exécuter le logiciel.</li></ul></div> <div>Remarque : Les exigences système ou logiciel, initialement exprimés comme non fonctionnelles, peuvent évoluer, au fur et à mesure que le projet progresse, en FUR pour le logiciel.</div>"
   },
   {
      "id":"17",
      "term":"Extrant (Output)",
      "definition":"<div>Toutes données déplacées par les Sorties d'un processus fonctionnel donné.</div>"
   },
   {
      "id":"18",
      "term":"Fonctionnalité Utilisateur Requise (FUR)",
      "definition":"<div>Un sous-ensemble des besoins de l'utilisateur. Les besoins qui décrivent ce que le logiciel doit accomplir, en termes de tâches et service.</div><br> <div>Remarque : La Fonctionnalité Utilisateur Requise inclut (mais n'est pas limitée au) :</div><div> <ul><li>Transfert de données (exemple: données d'entrée du client, envoyer un signal de contrôle);</li> <li>Transformation de données (exemple: calculer l'intérêt bancaire, déterminer la température moyenne);</li> <li>Stockage de données (exemple: emmagasiner la commande de l'usager, enregistrer la température ambiante sur une période);</li> <li>Extraction des données (exemple : liste (actuelle) des employés actuels, récupérer la position de l'avion).</li></ul></div> <div>Exemples de Requis Utilisateur qui ne sont pas des Fonctionnalités Utilisateur Requises incluent, mais ne sont pas limités (sauf exception - voir la sous section 1.2.3 du présent Manuel de mesurage pour plus d'information) à des :</div><div> <ul><li>contraintes de qualité (exemple : utilisabilité, fiabilité, efficience et portabilité);</li> <li>contraintes organisationnelles (exemple: locations pour opération, matériel cible et conformité aux normes);</li> <li>contraintes environnementales (exemple: interopérabilité, sécurité, protection de la vie privée et sécurité);</li> <li>contraintes d'implémentation (exemple: langage de développement, cédule de livraison).</li></ul></div>"
   },
   {
      "id":"19",
      "term":"Frontière",
      "definition":"<div>Une interface conceptuelle entre le <u>logiciel</u> à mesurer et ses utilisateurs fonctionnels.</div><br><div>Remarque: Il découle de la définition qu'il y a une limite entre n'importe lequel des deux morceaux de logiciel d'une même <u>couche</u> ou de différentes <u>couches</u> qui échangent des données, lorsqu'un <u>morceau de logiciel</u> est un <u>utilisateur fonctionnel </u>de l'autre et/ou vice versa.</div>"
   },
   {
      "id":"20",
      "term":"Groupe de données (type)",
      "definition":"<div>Tout ensemble distinct, non vide, et non ordonné de types d'attributs de données où chaque type d'<u>attribut de donnée</u> décrit un aspect complémentaire du même <u>objet d'intérêt</u>.</div>"
   },
   {
      "id":"21",
      "term":"Input",
      "definition":"<div>Les données déplacées par toutes les <u>Entrées</u> d'un <u>processus fonctionnel</u> donné.</div>"
   },
   {
      "id":"22",
      "term":"L",
      "definition":"<div>Abréviation pour <u>Lecture</u> type.</div>"
   },
   {
      "id":"23",
      "term":"Lecture (type)",
      "definition":"<div>Un <u>mouvement de données</u> qui déplace un <u>groupe de données</u> depuis sa partie de stockage persistant pour le mettre à la portée du <u>processus fonctionnel</u> (type) qui le requiert.</div><br> <div>Remarque : Un type <u>Lecture</u> inclut certaines <u>manipulations associées de données</u> - voir le Manuel de mesurage pour plus de détails.</div>"
   },
   {
      "id":"24",
      "term":"Logiciel",
      "definition":"<div>Un ensemble d'instructions informatiques, de données, de procédures et éventuellement de documentations opérées comme un tout, pour répondre à un ensemble de buts spécifiques, lesquels peuvent être décrits dans une perspective fonctionnelle via un ensemble fini de <u>Fonctionnalités Utilisateurs Requises (FUR) </u>ainsi que d'exigences techniques et qualitatives.</div>"
   },
   {
      "id":"25",
      "term":"Manipulation des données",
      "definition":"<div>Tout ce qui survient aux données autres qu'un mouvement de données vers l'intérieur ou l'extérieur d'un <u>processus fonctionnel</u>, ou entre un <u>processus fonctionnel</u> et le stockage persistant.</div>"
   },
   {
      "id":"26",
      "term":"Message erreur/confirmation",
      "definition":"<div>C'est une <u>Sortie</u> émise par un <u>processus fonctionnel</u> à l'attention d'un utilisateur humain qui soit, confirme que les données saisies ont été acceptées, ou confirme qu'il y a une erreur dans les données saisies.</div> <br><div>Remarque : Toute Sortie qui pourrait inclure une indication de faute, mais qui n'est pas faite à l'intention d'un utilisateur fonctionnel humain, n'est pas un message d'erreur/confirmation.</div>"
   },
   {
      "id":"27",
      "term":"Mesurage de la taille fonctionnelle (MTF)",
      "definition":"<div>Le processus de mesurage de la taille fonctionnelle.</div>"
   },
   {
      "id":"28",
      "term":"Méthode de mesurage",
      "definition":"<div>Une suite logique d'opérations, décrite de manière générique, utilisée pour l'exécution du mesurage.</div>"
   },
   {
      "id":"29",
      "term":"Méthode de mesurage de la taille fonctionnelle (MMTF)",
      "definition":"<div>Une implémentation spécifique de la MTF définie par un ensemble de règles, qui sont conformes aux caractéristiques obligatoires de la norme ISO/IEC 14143-1:1998.</div>"
   },
   {
      "id":"30",
      "term":"Mise à l'échelle (du mesurage)",
      "definition":"<div>Le processus de conversion d'un mesurage de la taille d'une unité de mesure à une mesure d'une autre unité de mesure.</div>"
   },
   {
      "id":"31",
      "term":"Modèle",
      "definition":"<div>Une description ou une analogie utilisée pour aider à visualiser un concept qui ne peut être observé directement.</div>"
   },
   {
      "id":"32",
      "term":"Modèle de stratégie du mesurage",
      "definition":"<div>Un modèle normalisé qui peut-être être appliqué lors du mesurage d'un <u>morceau de logiciel</u> provenant d'un domaine fonctionnel du <u>logiciel</u> donné, qui définit les types <u>d'utilisateurs fonctionnels</u> et qui peut interagir avec le <u>logiciel</u>, le <u>niveau de décomposition</u> du <u>logiciel</u> et les types de <u>mouvements de données</u> que le <u>logiciel</u> peut manipuler.</div>"
   },
   {
      "id":"33",
      "term":"Modification (de la fonctionnalité d'un mouvement de données)",
      "definition":"<div>a) Un mouvement de données est considéré fonctionnellement modifié si au moins une des conditions suivantes s'applique:</div> <div><ul><li>le groupe de données déplacé est modifié,</li> <li>la manipulation de données associée est modifiée.</li></ul></div> <div>b) Un groupe de données est modifié, si au moins une des conditions suivantes s'applique :</div><div> <ul><li>un ou plusieurs nouveaux attributs sont ajoutés au groupe de données,</li> <li>un ou plusieurs attributs existants sont supprimés du groupe de données, </li> <li>un ou plusieurs attributs existants sont modifiés, par exemple la présentation ou le format (le changement des valeurs ne compte pas)</li></ul></div> <div>c) une manipulation de données est modifiée, si elle est, de quelque façon, fonctionnellement changée.</div>"
   },
   {
      "id":"34",
      "term":"Morceau de logiciel",
      "definition":"<div>N'importe quel élément discret du logiciel à n'importe quel niveau de décomposition à partir d'un système logiciel entier jusqu'à un élément se trouvant au niveau du plus petit composant d'un système logiciel.</div>"
   },
   {
      "id":"35",
      "term":"Morceaux de logiciel de même niveau",
      "definition":"<div>Deux morceaux d'un logiciel sont de même niveau si chacun réside dans la même couche.</div>"
   },
   {
      "id":"36",
      "term":"Mouvement de données (type)",
      "definition":"<div>Un <u>composant fonctionnel de base</u> qui déplace un seul type de <u>groupe de données</u>.</div><br> <div>Remarque 1: Il y a quatre sous-types de mouvements de données: Entrée (E), Sortie (S), Lecture (L), éCriture (C). </div><br> <div>Remarque 2 : Pour le besoin de la mesure, chaque sous-type de mouvement de données est considéré comme tenant compte d'un certain nombre de manipulation de données qui y sont associées – voir le Manuel de Mesurage pour plus de détails.</div><br> <div>Remarque 3 : Pour préciser, c'est l'occurrence d'un mouvement de données, non son type, qui en pratique <u>déplace</u> les occurrences d'un groupe de données. Cette remarque s'applique aussi aux définitions de: Entrée (E), Sortie (S), Lecture (L), éCriture (C).</div>"
   },
   {
      "id":"37",
      "term":"Niveau de décomposition",
      "definition":"<div>N'importe quel niveau résultant de la division d'un <u>morceau de logiciel</u> en <u>composants</u> (nommé 'niveau 1', par exemple), puis diviser les <u>composants</u> en sous-composants ('niveau 2'), et ensuite diviser les sous-<u>composants</u> en sous-sous composants ('niveau 3'), etc... </div> <br><div>Remarque 1: Ne pas confondre avec '<u>niveau de granularité</u>'. </div> <br><div>Remarque 2: Le mesurage de la taille des composants d'un morceau du logiciel peut être comparé directement seulement aux composants d'un même <u>niveau de décomposition</u>.</div>"
   },
   {
      "id":"38",
      "term":"Niveau de granularité du processus fonctionnel.",
      "definition":"<div>Un <u>niveau de granularité </u>de la description d'un <u>morceau de logiciel</u> pour lequel :</div><div><ul><li><u>les utilisateurs fonctionnels</u> sont des individus humains ou des objets d'ingénierie ou d'autres morceaux de logiciel (et non pas de quelconques groupes de ceux-ci) ET;</li> <li>des évènements spécifiques surviennent auxquels un <u>morceau du logiciel</u> doit répondre (et pas à un quelconque niveau de granularité où seulement des groupes d'évènements seraient définis). Voir la remarque 3 ci-après.</li></ul></div> <div>REMARQUE 1: En pratique, la documentation du logiciel et donc les FUR décrivent souvent les fonctionnalités à divers <u>niveaux de granularité</u>, plus particulièrement quand la documentation est toujours en cours d'élaboration. </div><br> <div>REMARQUE 2: Les 'Groupes ciblés (utilisateurs fonctionnels) peuvent être, par exemple, est un 'département' dont les membres peuvent effectuer plusieurs types de processus fonctionnels, ou un 'panneau de contrôle' qui a plusieurs types d'instruments, ou des 'systèmes centraux'. </div><br> <div>REMARQUE 3: Les 'Groupes d'évènements' peuvent, par exemple, être exprimés dans l'énoncé d'une FUR à un haut niveau de granularité par un flux d'intrants pour un système comptable nommé 'transactions de vente' ou par un flux d'intrants à un logiciel avionique appelée 'commande de pilotage'.</div>"
   },
   {
      "id":"39",
      "term":"Niveau de granularité",
      "definition":"<div>Tout niveau d'expansion de la description d'un seul <u>morceau de logiciel</u> (c.-à-d. un énoncé d'une exigence, ou la description d'une structure d'un morceau de logiciel) tel que chaque niveau supérieur d'expansion, la description de la fonctionnalité du <u>morceau du logiciel</u> est à un niveau supérieur et uniforme de détails.</div> <br><div>REMARQUE: Les mesureurs doivent tenir compte de l'évolution précoce des exigences dans le cycle de vie d'un projet. À tout moment, différentes parties des fonctionnalités requises du logiciel seront typiquement documentées à différents niveaux de granularité.</div>"
   },
   {
      "id":"40",
      "term":"Object d'intérêt (type)",
      "definition":"<div>Toute 'chose' qui est identifiée du point de vue d'un utilisateur fonctionnel qui est identifiée dans les Fonctionnalités Utilisateurs Requises (FUR) au sujet desquelles le logiciel est requis pour traiter et/ou stocker des données. Ce peut être toute chose physique, aussi bien que tout objet conceptuel ou partie d'un objet conceptuel.</div><br> <div>Remarque 1 : Dans la définition ci-dessus, 'processus' peut signifier toute opération de déplacer et/ou manipuler des données. </div><br> <div>Remarque 2 : Dans la méthode COSMIC, le terme '<u>objet d'intérêt</u>' est utilisé pour éviter d'utiliser des termes reliés à des méthodologies spécifiques du génie logiciel. Le terme ne correspond pas nécessairement au terme 'objet' selon le sens utilisé dans les méthodes orientées objets.</div>"
   },
   {
      "id":"41",
      "term":"Périmètre (du mesurage)",
      "definition":"<div>C'est l'ensemble des Fonctionnalités Utilisateur Requises (FUR) qui doivent être incluses dans une occurrence spécifique du mesurage de taille fonctionnelle.</div><br> <div>REMARQUE : (spécifique à la méthode COSMIC) une distinction doit être faite entre le 'périmètre global', c.-à-d. tout le logiciel qui doit être mesuré selon la raison d'être du mesurage, et le 'périmètre, de chaque morceau de logiciel à l'intérieur de cette raison d'être globale, et pour lequel la taille doit être mesurée séparément. Dans le Manuel de mesurage, le terme 'périmètre' (ou l'expression 'périmètre du mesurage') sera relié à tout morceau de logiciel individuel dont la taille doit être mesurée séparément.</div>"
   },
   {
      "id":"42",
      "term":"Processus fonctionnel (type)",
      "definition":"<div>a) Un ensemble de mouvements de données représentant une partie élémentaire des FUR pour le logiciel à mesurer, qui est unique dans cette FUR et qui peut être défini indépendamment de tout autre processus fonctionnel dans cette FUR.</div><br> <div>b) Un processus fonctionnel a seulement une seule Entrée de déclenchement.. Chaque processus fonctionnel démarre le traitement dès réception d'un <u>groupe de données</u> déplacé par <u>un mouvement de données Entrée de déclenchement</u> du processus fonctionnel. </div><br><div>c) L'ensemble de tous les <u>mouvements de données</u> d'un <u>processus fonctionnel</u> est l'ensemble qui est nécessaire pour satisfaire sa FUR pour toutes les réponses possibles par <u>l'Entrée de déclenchement</u>. </div><br> <div>Remarque 1: Lors de l'implémentation, c'est une occurrence d'un processus fonctionnel qui déclenche l'exécution, et ce à la réception d'une occurrence d'un <u>groupe de données</u> déplacé par une occurrence de l'Entrée de déclenchement. </div><br> <div>Remarque 2: La <u>FUR</u> pour un processus fonctionnel peut exiger une ou plusieurs autres Entrées en plus de l'Entrée de déclenchement. </div><br> <div>Remarque 3: Si un utilisateur fonctionnel envoie un groupe de données avec des erreurs, par exemple parce qu'un capteur-usager a un mauvais fonctionnement ou une commande d'entrée par un être humain comporte des erreurs, c'est habituellement la tâche du processus fonctionnel de déterminer si l'évènement a vraiment eu lieu et/ou les données entrées sont vraiment valables. Le processus fonctionnel indique aussi comment répondre."
   },
   {
      "id":"43",
      "term":"Raison d'être du mesurage",
      "definition":"<div>Un énoncé qui indique pourquoi une mesure est exigée, et comment le résultat sera employé.</div>"
   },
   {
      "id":"44",
      "term":"S",
      "definition":"<div>Abréviation pour Sortie (type).</div>"
   },
   {
      "id":"45",
      "term":"Sous-processus (type)",
      "definition":"<div>Une partie d'un <u>processus fonctionnel</u> qui soit, déplace des données (dans le logiciel d'un utilisateur fonctionnel ou hors le logiciel pour un utilisateur fonctionnel, ou à partir ou depuis du stockage persistant) ou manipule des données.</div>"
   },
   {
      "id":"46",
      "term":"Stockage persistant",
      "definition":"<div>Un type de stockage qui permet à un <u>processus fonctionnel</u> de conserver des données au-delà de la vie du <u>processus fonctionnel</u> et/ou qui permet à un <u>processus fonctionnel</u> de retrouver une donnée stockée par un autre <u>processus fonctionnel</u>, ou stockée plus tôt au cours d'une occurrence du même <u>processus fonctionnel</u> ou stockée par un autre processus.</div><br> <div>Remarque 1 : Dans le modèle COSMIC, le stockage persistant est un concept qui existe seulement à l'intérieur de la frontière du logiciel à mesurer, il ne peut donc être considéré comme un utilisateur fonctionnel du logiciel à mesurer. </div> <br><div>Remarque 2 : Un exemple pour 'un autre processus' serait la fabrication de mémoires à lecture seulement.</div>"
   },
   {
      "id":"47",
      "term":"Système logiciel",
      "definition":"<div>Un système composé uniquement de logiciels.</div>"
   },
   {
      "id":"48",
      "term":"Système",
      "definition":"<div>Une combinaison de matériel, de logiciels et de procédures manuelles organisé pour répondre à des fins établies à l'avance.</div><br> <div>Remarque: La définition ci-dessus est une adaptation de la définition de la norme ISO/IEC 15288:2008. Dans la définition COSMIC, 'matériel, logiciel et manuel de procédures' remplacent 'éléments qui interagissent' dans la définition de la norme ISO/IEC.</div>"
   },
   {
      "id":"49",
      "term":"Taille fonctionnelle",
      "definition":"<div>Une taille du logiciel dérivé en quantifiant les Fonctionnalités Utilisateurs Requises.</div>"
   },
   {
      "id":"50",
      "term":"Type d'évènement",
      "definition":"<div>Quelque chose qui arrive.</div>"
   },
   {
      "id":"51",
      "term":"Sortie (type)",
      "definition":"<div>Un type de <u>mouvement de données</u> qui déplace, à travers <u>la frontière</u>, un <u>groupe de données</u> d'un processus fonctionnel vers <u>l'utilisateur fonctionnel</u> qui le requiert.<div><br> <div>Remarque : Une Sortie type tient aussi compte de certaines <u>manipulations de données</u> associées (voir le Manuel de Mesurage pour plus de détails).</div>"
   },
   {
      "id":"52",
      "term":"Unité de mesurage",
      "definition":"<div>Grandeur particulière, définie et adoptée par convention, à laquelle on compare les autres grandeurs de même nature pour les exprimer quantitativement par rapport à cette grandeur. Il doit être note que les unités de mesurage ont par convention été assignées des noms et des symboles.</div><br> <div>Voir aussi '<u>Unité de mesurage COSMIC</u>'.</div>"
   },
   {
      "id":"53",
      "term":"Unité de mesurage COSMIC",
      "definition":"<div>1 CFP (<u>C</u>OSMIC <u>F</u>unction Point ou <u>P</u>oint de <u>F</u>onction <u>C</u>OSMIC), définit comme la taille <u>d'un mouvement de données</u>.</div><br> <div>Remarque : L'unité de mesurage COSMIC était connue sous le nom de 'Cfsu' (COSMIC functional size unit) avant v3.0 de la méthode.</div>"
   },
   {
      "id":"54",
      "term":"Utilisateur",
      "definition":"<div>N'importe quelle personne ou chose qui communique or interagit avec le logiciel à n'importe quel moment.</div><br> <div>Remarque : les exemples de 'chose' incluent, mais ne sont pas limités à, des applications logicielles, des animaux, des senseurs or d'autre matériel.</div>"
   },
   {
      "id":"55",
      "term":"Utilisateur fonctionnel",
      "definition":"<div>Un (type d') utilisateur qui est l'émetteur et/ou le récipient de données comme prévu par la Fonctionnalité Utilisateur Requise d'un morceau de logiciel.</div>"
   },
   {
      "id":"56",
      "term":"Valeur (d'une grandeur)",
      "definition":"<div>Expression quantitative d'une grandeur particulière, généralement sous la forme d'un <u>étalon de mesure</u> multiplié par un nombre.</div>"
   }
]
